<?php

namespace App\Services\PageBuilder\Block;

use App\Data\PageBuilder\Block\SpecsTable\SpecsTableData;
use Spatie\LaravelData\Data;

class SpecsTableBlock
{
    public function viewData(): ?Data
    {
        return SpecsTableData::from([
            'opened_index' => 1,

            'groups' => [
                [
                    'label' => 'Двигатель',
                    'rows' => [
                        [
                            'label' => 'Рабочий объем, л',
                            'items' => ['1.5', '1.5', '1.5', '1.5'],
                        ],
                        [
                            'label' => 'Рабочий объем, см3',
                            'items' => [1498, 1499, 1499, 1498],
                        ],
                        [
                            'label' => 'Количество клапанов',
                            'items' => [16, 16, 16, 16],
                        ],
                        [
                            'label' => 'Количество цилиндров',
                            'items' => [4, 4, 4, 4],
                        ],
                        [
                            'label' => 'Максимальная мощность, л.с.',
                            'items' => [147, 113, 113, 147],
                        ],
                        [
                            'label' => 'Номинальный крутящий момент, Н•м',
                            'items' => [210, 138, 138, 210],
                        ],
                        [
                            'label' => 'Об/мин КВТ',
                            'items' => [5500, 6150, 6150, 5500],
                        ],
                        [
                            'label' => 'Об/мин ЛС',
                            'items' => [5500, 6150, 6150, 5500],
                        ],
                        [
                            'label' => 'Об/мин НМ',
                            'items' => [4000, 4000, 4000, 4000],
                        ],
                        [
                            'label' => 'Расположение цилиндров',
                            'items' => ['в ряд', 'в ряд', 'в ряд', 'в ряд'],
                        ],
                        [
                            'label' => 'Тип топлива',
                            'items' => ['Бензин', 'Бензин', 'Бензин', 'Бензин'],
                        ],
                        [
                            'label' => 'Требования к топливу',
                            'items' => ['АИ-92', 'АИ-92', 'АИ-92', 'АИ-92'],
                        ],
                        [
                            'label' => 'Тип наддува',
                            'items' => ['С наддувом', 'Нет', 'Нет', 'С наддувом'],
                        ],
                        [
                            'label' => 'Экологический класс',
                            'items' => ['EURO5', 'EURO5', 'EURO5', 'EURO5'],
                        ],
                    ],
                ],

                [
                    'label' => 'Коробка передач',
                    'rows' => [
                        [
                            'label' => 'Тип трансмиссии',
                            'items' => ['Робот (AMT6)', 'Механика (MT5)', 'Вариатор (CVT)', 'Робот (AMT7)'],
                        ],
                        [
                            'label' => 'Тип привода',
                            'items' => ['Передний', 'Передний', 'Передний', 'Полный'],
                        ],
                        [
                            'label' => 'Количество передач',
                            'items' => [6, 5, null, 7],
                        ],
                    ],
                ],

                [
                    'label' => 'Кузов',
                    'rows' => [
                        [
                            'label' => 'Тип кузова',
                            'items' => ['Кроссовер', 'Кроссовер', 'Кроссовер', 'Кроссовер'],
                        ],
                        [
                            'label' => 'Тип ТС',
                            'items' => ['Легковой', 'Легковой', 'Легковой', 'Легковой'],
                        ],
                        [
                            'label' => 'Длина кузова',
                            'items' => [4320, 4320, 4320, 4320],
                        ],
                        [
                            'label' => 'Ширина кузова',
                            'items' => [1831, 1831, 1831, 1831],
                        ],
                        [
                            'label' => 'Высота кузова',
                            'items' => [1652, 1652, 1652, 1652],
                        ],
                        [
                            'label' => 'Колесная база',
                            'items' => [2610, 2610, 2610, 2610],
                        ],
                        [
                            'label' => 'Передняя колея',
                            'items' => [1550, 1550, 1550, 1550],
                        ],
                        [
                            'label' => 'Задняя колея',
                            'items' => [1550, 1550, 1550, 1550],
                        ],
                        [
                            'label' => 'Дорожный просвет',
                            'items' => [190, 208, 202, 190],
                        ],
                    ],
                ],

                [
                    'label' => 'Размеры салона',
                    'rows' => [
                        [
                            'label' => 'Количество дверей',
                            'items' => [5, 5, 5, 5],
                        ],
                        [
                            'label' => 'Количество мест',
                            'items' => [4, 4, 4, 4],
                        ],
                    ],
                ],

                [
                    'label' => 'Подвеска',
                    'rows' => [
                        [
                            'label' => 'Передняя подвеска',
                            'items' => [
                                'Независимая, типа Макферсон',
                                'Независимая, типа Макферсон',
                                'Независимая, типа Макферсон',
                                'Независимая, типа Макферсон',
                            ],
                        ],
                        [
                            'label' => 'Задняя подвеска',
                            'items' => [
                                'полузависимая, пружинная, с гидравлическими телескопическими амортизаторами, со стабилизатором попер',
                                'полузависимая, пружинная, с гидравлическими телескопическими амортизаторами, со стабилизатором попер',
                                'полузависимая, пружинная, с гидравлическими телескопическими амортизаторами, со стабилизатором попер',
                                'полузависимая, пружинная, с гидравлическими телескопическими амортизаторами, со стабилизатором попер',
                            ],
                        ],
                        [
                            'label' => 'Передний амортизатор',
                            'items' => ['Газовые', 'Газовые', 'Газовые', 'Газовые'],
                        ],
                        [
                            'label' => 'Задний амортизатор',
                            'items' => ['Газовые', 'Газовые', 'Газовые', 'Газовые'],
                        ],
                    ],
                ],

                [
                    'label' => 'Вес и допустимые нагрузки',
                    'rows' => [
                        [
                            'label' => 'Максимальная масса, кг',
                            'items' => [1798, 1701, 1747, 1915],
                        ],
                        [
                            'label' => 'Минимальная масса, кг',
                            'items' => [1462, 1379, 1418, 1589],
                        ],
                    ],
                ],

                [
                    'label' => 'Динамика',
                    'rows' => [
                        [
                            'label' => 'Разгон 0-100 км/ч, c',
                            'items' => ['10.0', '13.9', '14.6', '11.4'],
                        ],
                        [
                            'label' => 'Максимальная скорость, км/ч',
                            'items' => [185, 175, 165, 175],
                        ],
                    ],
                ],

                [
                    'label' => 'Расход топлива',
                    'rows' => [
                        [
                            'label' => 'Город, л/100 км',
                            'items' => ['9.2', '9.3', '9.4', '10.8'],
                        ],
                        [
                            'label' => 'Смешанный, л/100 км',
                            'items' => ['7.1', '7.4', '7.3', '8.3'],
                        ],
                        [
                            'label' => 'Трасса, л/100 км',
                            'items' => ['6.1', '6.3', '6.2', '6.9'],
                        ],
                    ],
                ],

                [
                    'label' => 'Гарантия производителя',
                    'rows' => [
                        [
                            'label' => 'Пробег, км',
                            'items' => [100000, 100000, 100000, 100000],
                        ],
                        [
                            'label' => 'Срок владения, мес',
                            'items' => [36, 36, 36, 36],
                        ],
                    ],
                ],

                [
                    'label' => 'Тормозная система',
                    'rows' => [
                        [
                            'label' => 'Передний тормоз',
                            'items' => [
                                'Дисковые вентилируемые',
                                'Дисковые вентилируемые',
                                'Дисковые вентилируемые',
                                'Дисковые вентилируемые',
                            ],
                        ],
                        [
                            'label' => 'Задний тормоз',
                            'items' => [
                                'Дисковые не вентилируемые',
                                'Дисковые не вентилируемые',
                                'Дисковые не вентилируемые',
                                'Дисковые не вентилируемые',
                            ],
                        ],
                    ],
                ],

                [
                    'label' => 'Вместимость',
                    'rows' => [
                        [
                            'label' => 'Объём багажного отделения (л) (VDA)',
                            'items' => [340, 340, 340, 312],
                        ],
                        [
                            'label' => 'Объём топливного бака, л',
                            'items' => [51, 51, 51, 57],
                        ],
                    ],
                ],
            ],
        ]);
    }
}
