<?php

return [
    'general' => [
        'contact' => [
            'locations' => [
                [
                    'label' => 'г. Москва, Дмитровское ш., д. 161А',
                    'coordinates' => [37.571, 55.882],
                ],
                [
                    'label' => 'г. Москва, Варшавское ш., д. 170Д',
                    'coordinates' => [37.618, 55.62],
                ],
                [
                    'label' => 'г. Москва, Кутузовский пр-т, д. 45',
                    'coordinates' => [37.506, 55.738],
                ],
            ],
        ],
    ],
];
